// npm i and npm install *****package*****

// let เป็นตัวแปรที่สามารถเปลี่ยนค่าได้
// ใช้ let เมื่อเราต้องการให้ตัวแปรสามารถเปลี่ยนค่าได้
// var เป็นตัวแปรที่สามารถเปลี่ยนค่าได้ 
// ใช้ var เมื่อเราต้องการให้ตัวแปรสามารถเปลี่ยนค่าได้ แต่ไม่แนะนำให้ใช้ var ใน ES6
// const เป็นตัวแปรที่ไม่สามารถเปลี่ยนค่าได้
// ใช้ const เมื่อเราต้องการให้ตัวแปรไม่สามารถเปลี่ยนค่าได้
let age = 25; // ตัวแปรที่สามารถเปลี่ยนค่าได้
age = 30; // เปลี่ยนค่าได้
console.log(age)
var name = "John"; // ตัวแปรที่สามารถเปลี่ยนค่าได้
name = 20; // เปลี่ยนค่าได้
console.log(name)
const pi = 3.14; // ตัวแปรที่ไม่สามารถเปลี่ยนค่าได้
pi = 3.14159; // จะเกิดข้อผิดพลาด เพราะไม่สามารถเปลี่ยนค่าได้
console.log(pi)

// === is ture
// !== is false
